Following Python code shows how to connect to an existing database. If the database does not exist, then it will be created and finally a database object will be returned.

In [1]:
#Connect To Database
import sqlite3

conn = sqlite3.connect('testdb1.db')

print("Opened database successfully")

Opened database successfully

In [4]:
##Create a Table
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb1.db')
print("Opened database successfully")

conn.execute('''CREATE TABLE WORKCOMPANY
         (ID            INT     PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         INT );''')
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [5]:
#INSERT Operation
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb1.db')
print("Opened database successfully")

conn.execute("INSERT INTO WORKCOMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO WORKCOMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO WORKCOMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO WORKCOMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

In [6]:
#create another table contacts
import sqlite3

conn = sqlite3.connect('testdb1.db')
print("Opened database successfully")

conn.execute('''CREATE TABLE CONTACTS(
         ID             INT     PRIMARY KEY NOT NULL,
         NAME           TEXT    NOT NULL,
         EMAIL          TEXT    NOT NULL UNIQUE,
         PHONE          INT     NOT NULL UNIQUE
         );
         ''')
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [7]:
import sqlite3

conn = sqlite3.connect('testdb1.db')
print("Opened database successfully")
conn.execute('''CREATE TABLE STUDENT(
         ID             INT     PRIMARY KEY NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL UNIQUE,
         SALARY         INT     NOT NULL UNIQUE,
         ADDRESS        TEXT    
         );
         ''')
conn.close()

Opened database successfully

In [8]:
import sqlite3

conn = sqlite3.connect('testdb1.db')
print("Opened database successfully")
conn.execute("INSERT INTO STUDENT (ID,NAME,AGE,SALARY) \
      VALUES (1, 'Paul', 32,  20000.00 )");

conn.execute("INSERT INTO STUDENT (ID,NAME,AGE,SALARY) \
      VALUES (2, 'Allen', 29,  15000.00 )");

conn.execute("INSERT INTO STUDENT (ID,NAME,AGE,SALARY) \
      VALUES (3, 'Teddy', 23, 22000.00 )");

conn.execute("INSERT INTO STUDENT (ID,NAME,AGE,SALARY) \
      VALUES (4, 'Mark', 25, 65000.00 )");

conn.commit()
print("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

In [9]:
#SELECT Operation
#display records from the table
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb.db')

cursor = conn.execute("SELECT * from STUDENT")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3], "\n")

conn.close()

ID =  1
NAME =  Paul
ADDRESS =  32
SALARY =  20000

ID =  2
NAME =  Allen
ADDRESS =  29
SALARY =  15000

ID =  3
NAME =  Teddy
ADDRESS =  23
SALARY =  22000

ID =  4
NAME =  Mark
ADDRESS =  25
SALARY =  65000

In [13]:
#UPDATE Operation
import sqlite3

conn = sqlite3.connect('testdb1.db')
conn.execute("UPDATE WORKCOMPANY set SALARY = 24800.00 where ID = 1")
conn.commit
print("Total number of rows updated :", conn.total_changes)
cursor = conn.execute("SELECT id,name,age,address,salary from WORKCOMPANY")
for row in cursor:
    print("id,", row[0])
    print("NAME = ", row[1])
    print('age', row[2])
    print("ADDRESS = ", row[3])
    print("SALARY = ", row[4], "\n")
conn.close()

Total number of rows updated : 1
id, 1
NAME =  Paul
age 32
ADDRESS =  California
SALARY =  24800

id, 2
NAME =  Allen
age 25
ADDRESS =  Texas
SALARY =  15000

id, 3
NAME =  Teddy
age 23
ADDRESS =  Norway
SALARY =  20000

id, 4
NAME =  Mark
age 25
ADDRESS =  Rich-Mond
SALARY =  65000

In [14]:
#DELETE operation
import sqlite3
conn = sqlite3.connect('testdb1.db')
conn.execute("DELETE from WORKCOMPANY where ID = 2")
conn.commit
print("changes", conn.total_changes)
cursor = conn.execute("SELECT id,name,address,salary from WORKCOMPANY")
for row in cursor:
    print("id,", row[0])
    print("NAME = ", row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3], "\n")
conn.close()

changes 1
id, 1
NAME =  Paul
ADDRESS =  California
SALARY =  20000

id, 3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000

id, 4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000

In [ ]:
import sqlite3
connection = sqlite3.connect("swechadb.db")
connection.close()

In [ ]:
connection = sqlite3.connect("swechadb.db")
connection.execute('''CREATE TABLE books(
    id      INT    PRIMARY KEY,
    NAME    TEXT,
    TOPIC   TEXT,
    DATE    DATE
);''')
connection.close()

In [ ]:
import sqlite3
connection = sqlite3.connect("swechadb.db")
connection.execute('''INSERT INTO books(id,NAME,TOPIC,DATE)
VALUES(1,"Swechabook","free software moment",2019-12-9)''')
connection.commit()
connection.close()

In [ ]:
import sqlite3
connection = sqlite3.connect("swechadb.db")
cursor = connection.execute('''SELECT id,NAME,TOPIC,DATE FROM books''')
for row in cursor.fetchall():
    print(row)

In [ ]:
import sqlite3
connection = sqlite3.connect("swechadb.db")
connection.execute("UPDATE books set TOPIC='software moment' where id = 1")
connection.commit
cursor = connection.execute("SELECT * from books")
for row in cursor:
    print(row)
connection.close()

In [ ]:
import sqlite3
connection = sqlite3.connect("swechadb.db")
connection.execute("INSERT INTO books VALUES(4,'SOFTWARE4','software4','2019-03-18')")
connection.commit
cursor = connection.execute("SELECT * from books")
for row in cursor:
    print(row)
connection.close()

In [ ]:
#!/usr/bin/env python2
# -*- coding: utf-8 -*-

import sqlite3 as lite

con = lite.connect('swechadb.db')
con.execute("CREATE TABLE cars(id INT, name TEXT, price INT)")
con.execute("INSERT INTO cars VALUES(1,'Audi',52642)")
con.execute("INSERT INTO cars VALUES(2,'Mercedes',57127)")
con.execute("INSERT INTO cars VALUES(3,'Skoda',9000)")
con.execute("INSERT INTO cars VALUES(4,'Volvo',29000)")
con.execute("INSERT INTO cars VALUES(5,'Bentley',350000)")
con.execute("INSERT INTO cars VALUES(6,'Citroen',21000)")
con.execute("INSERT INTO cars VALUES(7,'Hummer',41400)")
con.execute("INSERT INTO cars VALUES(8,'Volkswagen',21600)")
con.commit()
con.close()

In [ ]:
con = lite.connect('swechadb.db')
cursor = con.execute("SELECT * from cars")
for row in cursor.fetchall():
    print(row)

In [ ]:
con.execute("UPDATE cars set price = 53000 where id = 1")
con.commit()
cursor = con.execute("SELECT * from cars")
for row in cursor.fetchall():
    print(row)

In [ ]:
con.execute("DELETE from cars where id = 2")
con.commit()
cursor = con.execute("SELECT * from cars")
for row in cursor.fetchall():
    print(row)